## SQL JOIN

- SQL Join is used to fetch data from two or more tables, which is joined to appear as single set of data. It is used for combining column from two or more tables by using values common to both tables.

 - JOIN Keyword is used in SQL queries for joining two or more tables. Minimum required condition for joining table, is (n-1) where n, is number of tables. A table can also join to itself, which is known as, Self Join.

<img src='https://drive.google.com/uc?id=1nEWUZxbj3evyWa3r69V7rDWpoEfPRgib' height=500 width=500>

## Types of JOIN

- Following are the types of JOIN that we can use in SQL:

    1. Inner
    2. Outer
    3. Left
    4. Right

### Cross JOIN or Cartesian Product

- This type of JOIN returns the cartesian product of rows from the tables in Join.
- It will return a table which consists of records which combines each row from the first table with each row of the second table.

##### Cross JOIN Syntax

In [ ]:
SELECT column-name-list
FROM 
table-name1 CROSS JOIN table-name2;

#### Example of Cross JOIN
Following is the class table

<img src='https://drive.google.com/uc?id=1-Yt8yL8Td0I5DWf40E2wPD4YQB33HUDA' height=500 width=800>  
and the class_info table,

<img src='https://drive.google.com/uc?id=1kHndAV7oD_zgrMCm8hNg65jWyURaFMYo' height=500 width=800>  
Cross JOIN query will be,

In [ ]:
SELECT * FROM 
class CROSS JOIN class_info;

The resultset table will look like,
<img src='https://drive.google.com/uc?id=1A8sx9XHBdrfWSmgzTXqlaMNKiMFDwWrh' height=500 width=800>

**Note: This join returns the cross product of all the records present in both the tables.**

### INNER Join or EQUI Join

This is a simple JOIN in which the result is based on matched data as per the equality condition specified in the SQL query.

#### Inner Join Syntax

In [ ]:
SELECT column-name-list FROM 
table-name1 INNER JOIN table-name2 
WHERE table-name1.column-name = table-name2.column-name;

#### Example of INNER JOIN
Consider a class table,

<img src='https://drive.google.com/uc?id=1n5Xc8F8GO2wkgBD5jgw2aZQEt5XKQ4eZ' height=500 width=800>  
and the class_info table,

<img src='https://drive.google.com/uc?id=1RsgcA02oElXj1KyeWRBt8EPtLDpYWSXw' height=500 width=800>  
Inner JOIN query will be,

In [ ]:
SELECT * from class INNER JOIN class_info where class.id = class_info.id;

The resultset table will look like,
<img src='https://drive.google.com/uc?id=1I6FpRaX7M4ZWAAp826yDerGIng-7vnUf' height=500 width=800>

### Natural JOIN

- Natural Join is a type of Inner join which is based on column having same name and same datatype present in both the tables to be joined.

#### The syntax for Natural Join:

In [ ]:
SELECT * FROM 
table-name1 NATURAL JOIN table-name2;

#### Example of Natural JOIN
Here is the class table,

<img src='https://drive.google.com/uc?id=1n5Xc8F8GO2wkgBD5jgw2aZQEt5XKQ4eZ' height=500 width=800>  
and the class_info table,

<img src='https://drive.google.com/uc?id=1RsgcA02oElXj1KyeWRBt8EPtLDpYWSXw' height=500 width=800>  
Natural join query will be,

In [ ]:
SELECT * from class NATURAL JOIN class_info;

The resultset table will look like,
<img src='https://drive.google.com/uc?id=1fh-zivBYX1msGwget8bnpkMYDd9lVnGb' height=500 width=800>

**Note: Both the tables being joined have ID column(same name and same datatype), hence the records for which value of ID matches in both the tables will be the result of Natural Join of these two tables.**

### OUTER JOIN

- Outer Join is based on both matched and unmatched data. Outer Joins subdivide further into,

    1. Left Outer Join
    2. Right Outer Join
    3. Full Outer Join

### 1. LEFT Outer Join

- The left outer join returns a resultset table with the matched data from the two tables and then the remaining rows of the left table and null from the right table's columns.

#### Syntax for Left Outer Join

In [ ]:
SELECT column-name-list FROM 
table-name1 LEFT OUTER JOIN table-name2
ON table-name1.column-name = table-name2.column-name;

**Note: To specify a condition, we use the ON keyword with Outer Join.**

#### Left outer Join Syntax for Oracle:

In [ ]:
SELECT column-name-list FROM 
table-name1, table-name2 on table-name1.column-name = table-name2.column-name(+)

#### Example of Left Outer Join
Here is the class table,

<img src='https://drive.google.com/uc?id=1r1WHRoJ7OriM-bJjOGC3Ut1-AlbJeEHB' height=500 width=800>  
and the class_info table,

<img src='https://drive.google.com/uc?id=1p-WEQWaiiHnaoljx1fmXRyhINAnpT5qN' height=500 width=800>  
Left Outer Join query will be,

In [ ]:
SELECT * FROM class LEFT OUTER JOIN class_info ON (class.id = class_info.id);

The resultset table will look like,
<img src='https://drive.google.com/uc?id=1GYucQ2dLFfzcXsjtZ2IunlXEmgRRBmFb' height=500 width=800>

### 2. RIGHT Outer Join

- The right outer join returns a resultset table with the matched data from the two tables being joined, then the remaining rows of the right table and null for the remaining left table's columns.

#### Syntax for Right Outer Join

In [ ]:
SELECT column-name-list FROM 
table-name1 RIGHT OUTER JOIN table-name2 
ON table-name1.column-name = table-name2.column-name;

#### Right outer Join Syntax for Oracle

In [ ]:
SELECT column-name-list FROM 
table-name1, table-name2 
ON table-name1.column-name(+) = table-name2.column-name;

#### Example of Right Outer Join
Once again the class table,

<img src='https://drive.google.com/uc?id=1r1WHRoJ7OriM-bJjOGC3Ut1-AlbJeEHB' height=500 width=800>  
and the class_info table,

<img src='https://drive.google.com/uc?id=1p-WEQWaiiHnaoljx1fmXRyhINAnpT5qN' height=500 width=800>  
Right Outer Join query will be,

In [ ]:
SELECT * FROM class RIGHT OUTER JOIN class_info ON (class.id = class_info.id);

The resultant table will look like,
<img src='https://drive.google.com/uc?id=1pUgeZAQAd-Bw0TfWXJQSI8e9cu1FytqX' height=500 width=800>

### 3. Full Outer Join

- The full outer join returns a resultset table with the matched data of two table then remaining rows of both left table and then the right table.

### Syntax of Full Outer Join

In [ ]:
SELECT column-name-list FROM 
table-name1 FULL OUTER JOIN table-name2
ON table-name1.column-name = table-name2.column-name;

#### Example of Full outer join is,
The class table,

<img src='https://drive.google.com/uc?id=1r1WHRoJ7OriM-bJjOGC3Ut1-AlbJeEHB' height=500 width=800>  
and the class_info table,

<img src='https://drive.google.com/uc?id=1p-WEQWaiiHnaoljx1fmXRyhINAnpT5qN' height=500 width=800>  
Full Outer Join query will be like,

In [ ]:
SELECT * FROM class FULL OUTER JOIN class_info ON (class.id = class_info.id);

The resultset table will look like,
<img src='https://drive.google.com/uc?id=1q6Zw-CiAIP_M96Fp5yhRIyjTGeKQ52La' height=500 width=800>

#### DO it YourSelf

**Note : All Question is related to join your task is to apply join according to the question so that you will get the right answers.**

In [ ]:
# Ques:
    You need to create a table according to the diagram and apply the join condition so that it will produce the same
    output. You have given two table CUSTOMERS Table and ORDERS Table. In this table ID and OID is primary key and the 
    Order table CUSTOMER_ID is a foreign key.
    
    Table1:  CUSTOMERS Table
        +----+----------+-----+-----------+----------+
        | ID | NAME     | AGE | ADDRESS   | SALARY   |
        +----+----------+-----+-----------+----------+
        |  1 | Ramesh   |  32 | Ahmedabad |  2000.00 |
        |  2 | Khilan   |  25 | Delhi     |  1500.00 |
        |  3 | kaushik  |  23 | Kota      |  2000.00 |
        |  4 | Chaitali |  25 | Mumbai    |  6500.00 |
        |  5 | Hardik   |  27 | Bhopal    |  8500.00 |
        |  6 | Komal    |  22 | MP        |  4500.00 |
        |  7 | Muffy    |  24 | Indore    | 10000.00 |
        +----+----------+-----+-----------+----------+
        
    Table 2 − ORDERS Table
        +-----+---------------------+-------------+--------+
        |OID  | DATE                | CUSTOMER_ID | AMOUNT |
        +-----+---------------------+-------------+--------+
        | 102 | 2009-10-08 00:00:00 |           3 |   3000 |
        | 100 | 2009-10-08 00:00:00 |           3 |   1500 |
        | 101 | 2009-11-20 00:00:00 |           2 |   1560 |
        | 103 | 2008-05-20 00:00:00 |           4 |   2060 |
        +-----+---------------------+-------------+--------+
        
# Output:
    +----+----------+-----+--------+
    | ID | NAME     | AGE | AMOUNT |
    +----+----------+-----+--------+
    |  3 | kaushik  |  23 |   3000 |
    |  3 | kaushik  |  23 |   1500 |
    |  2 | Khilan   |  25 |   1560 |
    |  4 | Chaitali |  25 |   2060 |
    +----+----------+-----+--------+

In [ ]:
# Ques: 
    You need to create a table according to the diagram and apply the join condition so that it will produce the same
    output. You have given two table CUSTOMERS Table and ORDERS Table. In this table ID and OID is primary key and the 
    Order table CUSTOMER_ID is a foreign key.
    
    Table 1 − CUSTOMERS Table is as follows.
        +----+----------+-----+-----------+----------+
        | ID | NAME     | AGE | ADDRESS   | SALARY   |
        +----+----------+-----+-----------+----------+
        |  1 | Ramesh   |  32 | Ahmedabad |  2000.00 |
        |  2 | Khilan   |  25 | Delhi     |  1500.00 |
        |  3 | kaushik  |  23 | Kota      |  2000.00 |
        |  4 | Chaitali |  25 | Mumbai    |  6500.00 |
        |  5 | Hardik   |  27 | Bhopal    |  8500.00 |
        |  6 | Komal    |  22 | MP        |  4500.00 |
        |  7 | Muffy    |  24 | Indore    | 10000.00 |
        +----+----------+-----+-----------+----------+

    Table 2 − Orders Table is as follows.
        +-----+---------------------+-------------+--------+
        | OID | DATE                | CUSTOMER_ID | AMOUNT |
        +-----+---------------------+-------------+--------+
        | 102 | 2009-10-08 00:00:00 |           3 |   3000 |
        | 100 | 2009-10-08 00:00:00 |           3 |   1500 |
        | 101 | 2009-11-20 00:00:00 |           2 |   1560 |
        | 103 | 2008-05-20 00:00:00 |           4 |   2060 |
        +-----+---------------------+-------------+--------+
        
        
# Output:
    +----+----------+--------+---------------------+
    | ID | NAME     | AMOUNT | DATE                |
    +----+----------+--------+---------------------+
    |  1 | Ramesh   |   NULL | NULL                |
    |  2 | Khilan   |   1560 | 2009-11-20 00:00:00 |
    |  3 | kaushik  |   3000 | 2009-10-08 00:00:00 |
    |  3 | kaushik  |   1500 | 2009-10-08 00:00:00 |
    |  4 | Chaitali |   2060 | 2008-05-20 00:00:00 |
    |  5 | Hardik   |   NULL | NULL                |
    |  6 | Komal    |   NULL | NULL                |
    |  7 | Muffy    |   NULL | NULL                |
    +----+----------+--------+---------------------+

In [ ]:
# Ques: 
    You need to create a table according to the diagram and apply the join condition so that it will produce the same
    output. You have given two table CUSTOMERS Table and ORDERS Table. In this table ID and OID is primary key and the 
    Order table CUSTOMER_ID is a foreign key.
    
    Table 1 − CUSTOMERS Table is as follows.
        +----+----------+-----+-----------+----------+
        | ID | NAME     | AGE | ADDRESS   | SALARY   |
        +----+----------+-----+-----------+----------+
        |  1 | Ramesh   |  32 | Ahmedabad |  2000.00 |
        |  2 | Khilan   |  25 | Delhi     |  1500.00 |
        |  3 | kaushik  |  23 | Kota      |  2000.00 |
        |  4 | Chaitali |  25 | Mumbai    |  6500.00 |
        |  5 | Hardik   |  27 | Bhopal    |  8500.00 |
        |  6 | Komal    |  22 | MP        |  4500.00 |
        |  7 | Muffy    |  24 | Indore    | 10000.00 |
        +----+----------+-----+-----------+----------+

    Table 2 − ORDERS Table is as follows.
        +-----+---------------------+-------------+--------+
        |OID  | DATE                | CUSTOMER_ID | AMOUNT |
        +-----+---------------------+-------------+--------+
        | 102 | 2009-10-08 00:00:00 |           3 |   3000 |
        | 100 | 2009-10-08 00:00:00 |           3 |   1500 |
        | 101 | 2009-11-20 00:00:00 |           2 |   1560 |
        | 103 | 2008-05-20 00:00:00 |           4 |   2060 |
        +-----+---------------------+-------------+--------+

# Output:
    +------+----------+--------+---------------------+
    | ID   | NAME     | AMOUNT | DATE                |
    +------+----------+--------+---------------------+
    |    3 | kaushik  |   3000 | 2009-10-08 00:00:00 |
    |    3 | kaushik  |   1500 | 2009-10-08 00:00:00 |
    |    2 | Khilan   |   1560 | 2009-11-20 00:00:00 |
    |    4 | Chaitali |   2060 | 2008-05-20 00:00:00 |
    +------+----------+--------+---------------------+

In [ ]:
# Ques: 
    You need to create a table according to the diagram and apply the join condition so that it will produce the same
    output. You have given one table CUSTOMERS Table . In this table ID is primary key.
    
    Table 1 − CUSTOMERS Table is as follows.
        +----+----------+-----+-----------+----------+
        | ID | NAME     | AGE | ADDRESS   | SALARY   |
        +----+----------+-----+-----------+----------+
        |  1 | Ramesh   |  32 | Ahmedabad |  2000.00 |
        |  2 | Khilan   |  25 | Delhi     |  1500.00 |
        |  3 | kaushik  |  23 | Kota      |  2000.00 |
        |  4 | Chaitali |  25 | Mumbai    |  6500.00 |
        |  5 | Hardik   |  27 | Bhopal    |  8500.00 |
        |  6 | Komal    |  22 | MP        |  4500.00 |
        |  7 | Muffy    |  24 | Indore    | 10000.00 |
        +----+----------+-----+-----------+----------+
        
        
Output:
    +----+----------+---------+
    | ID | NAME     | SALARY  |
    +----+----------+---------+
    |  2 | Ramesh   | 1500.00 |
    |  2 | kaushik  | 1500.00 |
    |  1 | Chaitali | 2000.00 |
    |  2 | Chaitali | 1500.00 |
    |  3 | Chaitali | 2000.00 |
    |  6 | Chaitali | 4500.00 |
    |  1 | Hardik   | 2000.00 |
    |  2 | Hardik   | 1500.00 |
    |  3 | Hardik   | 2000.00 |
    |  4 | Hardik   | 6500.00 |
    |  6 | Hardik   | 4500.00 |
    |  1 | Komal    | 2000.00 |
    |  2 | Komal    | 1500.00 |
    |  3 | Komal    | 2000.00 |
    |  1 | Muffy    | 2000.00 |
    |  2 | Muffy    | 1500.00 |
    |  3 | Muffy    | 2000.00 |
    |  4 | Muffy    | 6500.00 |
    |  5 | Muffy    | 8500.00 |
    |  6 | Muffy    | 4500.00 |
    +----+----------+---------+

In [ ]:
# Ques: 
    You need to create a table according to the diagram and apply the join condition so that it will produce the same
    output. You have given two table CUSTOMERS Table and ORDERS Table. In this table ID and OID is primary key and the 
    Order table CUSTOMER_ID is a foreign key.
    
    
    Table 1 − CUSTOMERS table is as follows.
        +----+----------+-----+-----------+----------+
        | ID | NAME     | AGE | ADDRESS   | SALARY   |
        +----+----------+-----+-----------+----------+
        |  1 | Ramesh   |  32 | Ahmedabad |  2000.00 |
        |  2 | Khilan   |  25 | Delhi     |  1500.00 |
        |  3 | kaushik  |  23 | Kota      |  2000.00 |
        |  4 | Chaitali |  25 | Mumbai    |  6500.00 |
        |  5 | Hardik   |  27 | Bhopal    |  8500.00 |
        |  6 | Komal    |  22 | MP        |  4500.00 |
        |  7 | Muffy    |  24 | Indore    | 10000.00 |
        +----+----------+-----+-----------+----------+
        
        
    Table 2: ORDERS Table is as follows
        +-----+---------------------+-------------+--------+
        |OID  | DATE                | CUSTOMER_ID | AMOUNT |
        +-----+---------------------+-------------+--------+
        | 102 | 2009-10-08 00:00:00 |           3 |   3000 |
        | 100 | 2009-10-08 00:00:00 |           3 |   1500 |
        | 101 | 2009-11-20 00:00:00 |           2 |   1560 |
        | 103 | 2008-05-20 00:00:00 |           4 |   2060 |
        +-----+---------------------+-------------+--------+


# Output:
    +----+----------+--------+---------------------+
    | ID | NAME     | AMOUNT | DATE                |
    +----+----------+--------+---------------------+
    |  1 | Ramesh   |   3000 | 2009-10-08 00:00:00 |
    |  1 | Ramesh   |   1500 | 2009-10-08 00:00:00 |
    |  1 | Ramesh   |   1560 | 2009-11-20 00:00:00 |
    |  1 | Ramesh   |   2060 | 2008-05-20 00:00:00 |
    |  2 | Khilan   |   3000 | 2009-10-08 00:00:00 |
    |  2 | Khilan   |   1500 | 2009-10-08 00:00:00 |
    |  2 | Khilan   |   1560 | 2009-11-20 00:00:00 |
    |  2 | Khilan   |   2060 | 2008-05-20 00:00:00 |
    |  3 | kaushik  |   3000 | 2009-10-08 00:00:00 |
    |  3 | kaushik  |   1500 | 2009-10-08 00:00:00 |
    |  3 | kaushik  |   1560 | 2009-11-20 00:00:00 |
    |  3 | kaushik  |   2060 | 2008-05-20 00:00:00 |
    |  4 | Chaitali |   3000 | 2009-10-08 00:00:00 |
    |  4 | Chaitali |   1500 | 2009-10-08 00:00:00 |
    |  4 | Chaitali |   1560 | 2009-11-20 00:00:00 |
    |  4 | Chaitali |   2060 | 2008-05-20 00:00:00 |
    |  5 | Hardik   |   3000 | 2009-10-08 00:00:00 |
    |  5 | Hardik   |   1500 | 2009-10-08 00:00:00 |
    |  5 | Hardik   |   1560 | 2009-11-20 00:00:00 |
    |  5 | Hardik   |   2060 | 2008-05-20 00:00:00 |
    |  6 | Komal    |   3000 | 2009-10-08 00:00:00 |
    |  6 | Komal    |   1500 | 2009-10-08 00:00:00 |
    |  6 | Komal    |   1560 | 2009-11-20 00:00:00 |
    |  6 | Komal    |   2060 | 2008-05-20 00:00:00 |
    |  7 | Muffy    |   3000 | 2009-10-08 00:00:00 |
    |  7 | Muffy    |   1500 | 2009-10-08 00:00:00 |
    |  7 | Muffy    |   1560 | 2009-11-20 00:00:00 |
    |  7 | Muffy    |   2060 | 2008-05-20 00:00:00 |
    +----+----------+--------+---------------------+